#### ElementPhaseStatusFilter Members

---

|  |
| --- |
| ElementPhaseStatusFilter Class   Constructors   Methods   Properties   See Also |

The  ElementPhaseStatusFilter  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | ElementPhaseStatusFilter(ElementId, ElementOnPhaseStatus) | Constructs a new instance of a file to match elements that have a given phase status on the input phase. |
| Public method | ElementPhaseStatusFilter(ElementId, ICollection ElementOnPhaseStatus ) | Constructs a new instance of a file to match elements that have a given phase statuses on the input phase. |
| Public method | ElementPhaseStatusFilter(ElementId, ElementOnPhaseStatus, Boolean) | Constructs a new instance of a file to match elements that have a given phase status on the input phase, with the option to match all elements that have a phase status other than the input status. |
| Public method | ElementPhaseStatusFilter(ElementId, ICollection ElementOnPhaseStatus , Boolean) | Constructs a new instance of a file to match elements that have a given phase statuses on the input phase, with the option to match all elements that have a phase status other than the input statuses. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | (Inherited from  ElementFilter  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetPhaseStatuses | Returns the phase statuses assigned to this filter. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | PassesFilter(Element) | Applies the filter to a given element. (Inherited from  ElementFilter  .) |
| Public method | PassesFilter(Document, ElementId) | Applies the filter to a given element. (Inherited from  ElementFilter  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Inverted | True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected, and elements that would normally be rejected will be accepted. (Inherited from  ElementFilter  .) |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  ElementFilter  .) |
| Public property | PhaseId | The phase id. |

# See Also

ElementPhaseStatusFilter Class

Autodesk.Revit.DB Namespace